#include "Engine.h"

// Main Funtion. Easily replacable with any other funtion as long as it uses '#include "Engine.h"' and calls 'Engine Game;'
// ========================================================================================================================
int main( ) {
    // Game creation
    Engine Game;

    return 0;
}
// =========================================================================================
// Η Εργασία επίσης μπορουσε να υλοποιηθεί με περισσότερη χρήση της κληρονομικοτητας κλάσεων.
// Παρ' όλ' αυτά, άρχησε με μορφή που έχει τωρα και τελειοποιήθηκε με αυτην.
// Τα υπόλοιπα σχόλια γράφτηκαν στα αγγλικά διοτι βολεψαν τον προγραμματιστή (Εμένα) στην συνταξή τους!
// Και όπως πάντα...
// Η Εργασία υλοποιήθηκε σε λειτουργικό σύστημα Linux.
// Terminal Run command
// ====================
// g++ Main.cpp Map.cpp Player.cpp Enemy.cpp Stone.cpp Engine.cpp -o MazeGame -lncurses
// ./MazeGame